chat_system_1183480135_actor_description=Archmage Rezo.
chat_system_1183480135_snap_0_question=^?^[s]From the window on the upper floor of Magic Tower, a mage is shouting something, and swinging his arms.[/s]<br>Hey! Hey! [class]! Help!
chat_system_1183480135_snap_0_answer_0=^?^What's the matter?
chat_system_1183480135_snap_1_question=^?^Well, hello, [player]. How goes your adventure?
chat_system_1183480135_snap_1_answer_0=^?^It's alright. Show me what you have for sale.
chat_system_1183480135_snap_1_answer_1=^?^Ah yes, speaking of adventures, I have to go.
chat_system_1183480135_snap_1_answer_7=^?^Can you do anything with mana potions?
chat_system_1183480135_snap_1_answer_8=^?^About the mana potions...
chat_system_1183480135_snap_16_question=^?^Do something with mana potions you ask?
chat_system_1183480135_snap_16_answer_0=^?^Sure - I figured a powerful wizard such as yourself could do something with them...
chat_system_1183480135_snap_17_question=^?^Well, I can extract the powerful ingredients of the potion allowing me to create an incantation that will permanently raise your mana limit by 1 point per potion. Actually if you bring me more than a couple of potions I may be able to make the process more efficient...
chat_system_1183480135_snap_17_answer_0=^?^Wow! You can increase my mana?! I better go find some potions...
chat_system_1183480135_snap_17_answer_1=^?^Wow! You can increase my mana?! I have some potions on me...
chat_system_1183480135_snap_18_question=^?^So do you have any mana potions for me to process to expand your mana well, my boy?
chat_system_1183480135_snap_18_answer_0=^?^I don't have any right now, what can you do again?
chat_system_1183480135_snap_18_answer_1=^?^I've got some, but remind me what can you do again?
chat_system_1183480135_snap_18_answer_2=^?^Boost mana limit 1 for 1 mana potion.
chat_system_1183480135_snap_18_answer_3=^?^Boost mana limit 2 for 2 mana potions.
chat_system_1183480135_snap_18_answer_4=^?^Boost mana limit 7 for 5 mana potions.
chat_system_1183480135_snap_18_answer_5=^?^Boost mana limit 15 for 10 mana potions.
chat_system_1183480135_snap_18_answer_6=^?^You know, I've changed my mind - can you show me your shop?
chat_system_1183480135_snap_18_answer_7=^?^You know, I've changed my mind - adventure calls...
chat_system_1183480135_snap_19_question=^?^For 1 or 2 mana potions I'll boost your mana limit the same, but if you bring me 5 mana potions I can boost your mana limit by 7, and if you bring me 10 I can boost your mana limit by 15. I can't process any more than 10 potions at a time - that's the limit of my ability.
chat_system_1183480135_snap_19_answer_0=^?^Ok, sounds great! I've got some potions on me...
chat_system_1183480135_snap_19_answer_1=^?^Ok, sounds great! Adventure calls...
chat_system_1183480135_snap_20_question=^?^Thank you, my boy! Now let me begin the process...<br><br>[s]The mage goes into a room where you hear strange gurgling and bubbling noises... After a few minutes he returns and approaches you.[/s]<br><br>Ok, this shouldn't hurt a bit...<br><br>[s]The mage chants an incantation and you feel a modest boost to your magic reserves.[/s]
chat_system_1183480135_snap_20_answer_0=^?^Wow! I feel pretty good! I've got more potions...
chat_system_1183480135_snap_20_answer_1=^?^Wow! I feel pretty good! Adventure is calling...
chat_system_1183480135_snap_21_question=^?^Thank you, my boy! Now let me begin the process...<br><br>[s]The mage goes into a room where you hear strange gurgling and bubbling noises... After several minutes he returns and approaches you.[/s]<br><br>Ok, this might tingle a bit...<br><br>[s]The mage chants an incantation and you feel a wonderful tingling sensation as your mana reserves surge.[/s]
chat_system_1183480135_snap_21_answer_0=^?^Wow! I feel great! I've got more potions...
chat_system_1183480135_snap_21_answer_1=^?^Wow! I feel great! Adventure calls...